Amiya200/stm32_water_tank/Core/Src/model_handle.c
/***************************************************************
 *  HELONIX Water Pump Controller
 *  FINAL MODEL HANDLE – FULLY UPDATED (2025)
 *  Supports:
 *    - Timer (5 Slots) with DayMask + Enabled
 *    - Semi-Auto, Auto, Countdown, Twist, Manual
 *    - Soft Dry-Run FSM
 *    - DS1307 DOW (1–7 → Mon–Sun)
 ***************************************************************/

#include "model_handle.h"
#include "relay.h"
#include "led.h"
#include "global.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "uart_commands.h"
#include "stm32f1xx_hal.h"

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

/***************************************************************
 *  EXTERNAL MODULE VARIABLES
 ***************************************************************/
extern ADC_Data adcData;
extern RTC_Time_t time;
TimerSlot timerSlots[5] = {0};

/***************************************************************
 *  GLOBAL MODE FLAGS
 ***************************************************************/
volatile bool manualActive    = false;
volatile bool semiAutoActive  = false;
volatile bool countdownActive = false;
volatile bool twistActive     = false;
volatile bool timerActive     = false;
volatile bool autoActive      = false;

/***************************************************************
 *  MOTOR STATUS (0 = OFF, 1 = ON)
 ***************************************************************/
volatile uint8_t motorStatus = 0;

/***************************************************************
 *  SAFETY FLAGS
 ***************************************************************/
volatile bool senseDryRun         = false;   // TRUE = WATER PRESENT
volatile bool senseOverLoad       = false;
volatile bool senseOverUnderVolt  = false;
volatile bool senseMaxRunReached  = false;

/***************************************************************
 *  MANUAL OVERRIDE FLAG
 ***************************************************************/
volatile bool manualOverride = false;

/***************************************************************
 *  INTERNAL UTILITY
 ***************************************************************/
static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}

static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
}

/***************************************************************
 *  MOTOR CONTROL (ANTI-CHATTER)
 ***************************************************************/
static inline void motor_apply(bool on)
{
    if (on == Motor_GetStatus())
        return;

    Relay_Set(1, on);
    motorStatus = on ? 1 : 0;

    UART_SendStatusPacket();
}

static inline void start_motor(void) { motor_apply(true); }
static inline void stop_motor(void)  { motor_apply(false); }

bool Motor_GetStatus(void)
{
    return (motorStatus == 1);
}

/***************************************************************
 *  MANUAL MODE CONTROL
 ***************************************************************/
void ModelHandle_SetMotor(bool on)
{
    clear_all_modes();
    manualOverride = true;

    /* In manual mode dry-run is disabled */
    senseDryRun = false;

    if (on) start_motor();
    else    stop_motor();
}

/* RESET pump logic (SW1 short press) */
void reset(void)
{
    if (Motor_GetStatus())
    {
        stop_motor();
        HAL_Delay(2000);
        start_motor();
    }
    else
    {
        start_motor();
        HAL_Delay(2000);
        stop_motor();
    }
}

/***************************************************************
 *  TANK FULL DETECTION
 *  (5 ADC probes = level sensors)
 ***************************************************************/

void ModelHandle_StopAllModesAndMotor(void)
{
    manualActive     = false;
    semiAutoActive   = false;
    timerActive      = false;
    countdownActive  = false;
    twistActive      = false;
    autoActive       = false;

    ModelHandle_SetMotor(false);   // turn OFF motor safely
}

static inline bool isTankFull(void)
{
    static uint32_t stableStart = 0;
    static bool lastState = false;

    bool allZero = true;

    for (int i = 1; i <= 5; i++)
    {
        if (adcData.voltages[i] > 0.10f)
        {
            allZero = false;
            break;
        }
    }

    uint32_t now = HAL_GetTick();

    if (allZero)
    {
        if (!lastState)
        {
            lastState = true;
            stableStart = now;
        }

        if (now - stableStart >= 1000)
            return true;
    }
    else
    {
        lastState = false;
    }

    return false;
}

/***************************************************************
 *  DRY-RUN SENSOR CHECK
 *  Voltage <=0.01f → WATER PRESENT → dry=false
 *  Voltage > 0.01f → DRY → dry=true
 ***************************************************************/
void ModelHandle_CheckDryRun(void)
{
    /* Countdown, Semi-Auto, Manual ignore dry-run */
    if (manualActive || semiAutoActive || countdownActive)
    {
        senseDryRun = false;
        return;
    }

    float v = adcData.voltages[0];

    if (v > 0.01f)
        senseDryRun = false;   // WATER PRESENT
    else
        senseDryRun = true;    // DRY
}
void ModelHandle_ToggleManual(void)
{
    // Stop all other modes before manual
    timerActive     = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    autoActive      = false;

    manualActive = !manualActive;

    if (manualActive)
    {
        manualOverride = true;
        start_motor();
    }
    else
    {
        manualOverride = false;
        stop_motor();
    }
}


/***************************************************************
 *  SOFT DRY-RUN FSM
 ***************************************************************/
typedef enum {
    DRY_IDLE = 0,
    DRY_PROBE,
    DRY_NORMAL
} DryFSMState;

static DryFSMState dryState = DRY_IDLE;
static bool dryConfirming   = false;

static uint32_t dryDeadline     = 0;
static uint32_t dryConfirmStart = 0;

#define DRY_PROBE_ON_MS      5000UL
#define DRY_PROBE_OFF_MS    10000UL
#define DRY_CONFIRM_MS       1500UL

static inline bool isAnyModeActive(void)
{
    return (manualActive ||
            semiAutoActive ||
            countdownActive ||
            twistActive ||
            timerActive ||
            autoActive);
}

